controllers/SiteController.php

SELECT * FROM `article` WHERE `id`='7'
---
    public function actionView($id)
    {
        $article = Article::findOne($id);