models/Article.php

INSERT INTO `article` (`title`, `description`, `content`, `date`, `user_id`) VALUES ('Топ 10 лучших сериалов 2018 года по версии IMDB', '', 'IMDB - крупнейший сайт, посвященный кинематографу, составил список самых популярных сериалов уходящего года. Берите на заметку, что посмотреть во время новогодних каникул.\r\n\r\nЛидером топа стали «Ходячие мертвецы», и это несмотря на то, что девятый сезон показал рекордно низкие рейтинги за всю историю зомби-экшена.\r\n\r\n«Серебро» досталось «Черному зеркалу», злободневному сериалу о том, как высокие технологии пагубно влияют на жизнь наших современников. \r\n\r\nТретью строчку занимает хит HBO «Мир Дикого Запада» о футуристических парках развлечений, где роботы, полностью имитирующие людей, выполняют все прихоти богатых посетителей. \r\n\r\nНа четвертом месте оказалась фантастическая драма «Рассказ служанки». Действие разворачивается в будущем, в котором женщины практически утратили детородную функцию. Так появляются «служанки», чей долг стать суррогатными матерями для будущих детей высокопоставленных чиновников.\r\n\r\nЗамыкает пятерку «Анатомия страсти» - долгоиграющий сериал о жизни медиков из Сиэтла.\r\n\r\nТакже в топ 10 лучших сериалов этого года вошли «Призраки дома на холме», «Американская история ужасов», «Викинги», «13 причин почему» и «Бесстыдники». ', NULL, 109585287)
UPDATE `article` SET `date`='18-12-04' WHERE `id`=9
---
    public function saveArticle()
    {
        $this->user_id = Yii::$app->user->id;
        return $this->save(false);

UPDATE `article` SET `image`='8e57469c06e547f74c3103b1c9422438.jpg' WHERE `id`=10
---
    public function saveImage($filename)
    {
        $this->image = $filename;
        return $this->save(false);

SELECT COUNT(*) FROM `article`
SELECT * FROM `article` LIMIT 3 OFFSET 3
---
    public static function getAll($pageSize = 5)
    {
        $query = Article::find();

        $count = $query->count();

        $pagination = new Pagination(['totalCount' => $count, 'pageSize'=>$pageSize]);

        $articles = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `article` ORDER BY `viewed` DESC LIMIT 3
---
    public static function getPopular()
    {
        return Article::find()->orderBy('viewed desc')->limit(3)->All();

SELECT * FROM `article` ORDER BY `date` LIMIT 4
---
    public static function getRecent()
    {
        return Article::find()->orderBy('date asc')->limit(4)->All();