models/Category.php

    public static function getAll()
    {
        return Category::find()->all();
---
SELECT * FROM `category`